
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 13, 256, 512]             364
         MaxPool2d-2          [-1, 3, 256, 512]               0
       BatchNorm2d-3         [-1, 16, 256, 512]              32
  DownsamplerBlock-4         [-1, 16, 256, 512]               0
            Conv2d-5         [-1, 48, 128, 256]           6,960
         MaxPool2d-6         [-1, 16, 128, 256]               0
       BatchNorm2d-7         [-1, 64, 128, 256]             128
  DownsamplerBlock-8         [-1, 64, 128, 256]               0
            Conv2d-9         [-1, 64, 128, 256]          12,352
           Conv2d-10         [-1, 64, 128, 256]          12,352
      BatchNorm2d-11         [-1, 64, 128, 256]             128
           Conv2d-12         [-1, 64, 128, 256]          12,352
           Conv2d-13         [-1, 64, 128, 256]          12,352
      BatchNorm2d-14         [-1, 64, 128, 256]             128
        Dropout2d-15         [-1, 64, 128, 256]               0
non_bottleneck_1d-16         [-1, 64, 128, 256]               0
           Conv2d-17         [-1, 64, 128, 256]          12,352
           Conv2d-18         [-1, 64, 128, 256]          12,352
      BatchNorm2d-19         [-1, 64, 128, 256]             128
           Conv2d-20         [-1, 64, 128, 256]          12,352
           Conv2d-21         [-1, 64, 128, 256]          12,352
      BatchNorm2d-22         [-1, 64, 128, 256]             128
        Dropout2d-23         [-1, 64, 128, 256]               0
non_bottleneck_1d-24         [-1, 64, 128, 256]               0
           Conv2d-25         [-1, 64, 128, 256]          12,352
           Conv2d-26         [-1, 64, 128, 256]          12,352
      BatchNorm2d-27         [-1, 64, 128, 256]             128
           Conv2d-28         [-1, 64, 128, 256]          12,352
           Conv2d-29         [-1, 64, 128, 256]          12,352
      BatchNorm2d-30         [-1, 64, 128, 256]             128
        Dropout2d-31         [-1, 64, 128, 256]               0
non_bottleneck_1d-32         [-1, 64, 128, 256]               0
           Conv2d-33         [-1, 64, 128, 256]          12,352
           Conv2d-34         [-1, 64, 128, 256]          12,352
      BatchNorm2d-35         [-1, 64, 128, 256]             128
           Conv2d-36         [-1, 64, 128, 256]          12,352
           Conv2d-37         [-1, 64, 128, 256]          12,352
      BatchNorm2d-38         [-1, 64, 128, 256]             128
        Dropout2d-39         [-1, 64, 128, 256]               0
non_bottleneck_1d-40         [-1, 64, 128, 256]               0
           Conv2d-41         [-1, 64, 128, 256]          12,352
           Conv2d-42         [-1, 64, 128, 256]          12,352
      BatchNorm2d-43         [-1, 64, 128, 256]             128
           Conv2d-44         [-1, 64, 128, 256]          12,352
           Conv2d-45         [-1, 64, 128, 256]          12,352
      BatchNorm2d-46         [-1, 64, 128, 256]             128
        Dropout2d-47         [-1, 64, 128, 256]               0
non_bottleneck_1d-48         [-1, 64, 128, 256]               0
           Conv2d-49          [-1, 64, 64, 128]          36,928
        MaxPool2d-50          [-1, 64, 64, 128]               0
      BatchNorm2d-51         [-1, 128, 64, 128]             256
 DownsamplerBlock-52         [-1, 128, 64, 128]               0
           Conv2d-53         [-1, 128, 64, 128]          49,280
           Conv2d-54         [-1, 128, 64, 128]          49,280
      BatchNorm2d-55         [-1, 128, 64, 128]             256
           Conv2d-56         [-1, 128, 64, 128]          49,280
           Conv2d-57         [-1, 128, 64, 128]          49,280
      BatchNorm2d-58         [-1, 128, 64, 128]             256
        Dropout2d-59         [-1, 128, 64, 128]               0
non_bottleneck_1d-60         [-1, 128, 64, 128]               0
           Conv2d-61         [-1, 128, 64, 128]          49,280
           Conv2d-62         [-1, 128, 64, 128]          49,280
      BatchNorm2d-63         [-1, 128, 64, 128]             256
           Conv2d-64         [-1, 128, 64, 128]          49,280
           Conv2d-65         [-1, 128, 64, 128]          49,280
      BatchNorm2d-66         [-1, 128, 64, 128]             256
        Dropout2d-67         [-1, 128, 64, 128]               0
non_bottleneck_1d-68         [-1, 128, 64, 128]               0
           Conv2d-69         [-1, 128, 64, 128]          49,280
           Conv2d-70         [-1, 128, 64, 128]          49,280
      BatchNorm2d-71         [-1, 128, 64, 128]             256
           Conv2d-72         [-1, 128, 64, 128]          49,280
           Conv2d-73         [-1, 128, 64, 128]          49,280
      BatchNorm2d-74         [-1, 128, 64, 128]             256
        Dropout2d-75         [-1, 128, 64, 128]               0
non_bottleneck_1d-76         [-1, 128, 64, 128]               0
           Conv2d-77         [-1, 128, 64, 128]          49,280
           Conv2d-78         [-1, 128, 64, 128]          49,280
      BatchNorm2d-79         [-1, 128, 64, 128]             256
           Conv2d-80         [-1, 128, 64, 128]          49,280
           Conv2d-81         [-1, 128, 64, 128]          49,280
      BatchNorm2d-82         [-1, 128, 64, 128]             256
        Dropout2d-83         [-1, 128, 64, 128]               0
non_bottleneck_1d-84         [-1, 128, 64, 128]               0
           Conv2d-85         [-1, 128, 64, 128]          49,280
           Conv2d-86         [-1, 128, 64, 128]          49,280
      BatchNorm2d-87         [-1, 128, 64, 128]             256
           Conv2d-88         [-1, 128, 64, 128]          49,280
           Conv2d-89         [-1, 128, 64, 128]          49,280
      BatchNorm2d-90         [-1, 128, 64, 128]             256
        Dropout2d-91         [-1, 128, 64, 128]               0
non_bottleneck_1d-92         [-1, 128, 64, 128]               0
           Conv2d-93         [-1, 128, 64, 128]          49,280
           Conv2d-94         [-1, 128, 64, 128]          49,280
      BatchNorm2d-95         [-1, 128, 64, 128]             256
           Conv2d-96         [-1, 128, 64, 128]          49,280
           Conv2d-97         [-1, 128, 64, 128]          49,280
      BatchNorm2d-98         [-1, 128, 64, 128]             256
        Dropout2d-99         [-1, 128, 64, 128]               0
non_bottleneck_1d-100         [-1, 128, 64, 128]               0
          Conv2d-101         [-1, 128, 64, 128]          49,280
          Conv2d-102         [-1, 128, 64, 128]          49,280
     BatchNorm2d-103         [-1, 128, 64, 128]             256
          Conv2d-104         [-1, 128, 64, 128]          49,280
          Conv2d-105         [-1, 128, 64, 128]          49,280
     BatchNorm2d-106         [-1, 128, 64, 128]             256
       Dropout2d-107         [-1, 128, 64, 128]               0
non_bottleneck_1d-108         [-1, 128, 64, 128]               0
          Conv2d-109         [-1, 128, 64, 128]          49,280
          Conv2d-110         [-1, 128, 64, 128]          49,280
     BatchNorm2d-111         [-1, 128, 64, 128]             256
          Conv2d-112         [-1, 128, 64, 128]          49,280
          Conv2d-113         [-1, 128, 64, 128]          49,280
     BatchNorm2d-114         [-1, 128, 64, 128]             256
       Dropout2d-115         [-1, 128, 64, 128]               0
non_bottleneck_1d-116         [-1, 128, 64, 128]               0
         Encoder-117         [-1, 128, 64, 128]               0
 ConvTranspose2d-118         [-1, 64, 128, 256]          73,792
     BatchNorm2d-119         [-1, 64, 128, 256]             128
  UpsamplerBlock-120         [-1, 64, 128, 256]               0
          Conv2d-121         [-1, 64, 128, 256]          12,352
          Conv2d-122         [-1, 64, 128, 256]          12,352
     BatchNorm2d-123         [-1, 64, 128, 256]             128
          Conv2d-124         [-1, 64, 128, 256]          12,352
          Conv2d-125         [-1, 64, 128, 256]          12,352
     BatchNorm2d-126         [-1, 64, 128, 256]             128
non_bottleneck_1d-127         [-1, 64, 128, 256]               0
          Conv2d-128         [-1, 64, 128, 256]          12,352
          Conv2d-129         [-1, 64, 128, 256]          12,352
     BatchNorm2d-130         [-1, 64, 128, 256]             128
          Conv2d-131         [-1, 64, 128, 256]          12,352
          Conv2d-132         [-1, 64, 128, 256]          12,352
     BatchNorm2d-133         [-1, 64, 128, 256]             128
non_bottleneck_1d-134         [-1, 64, 128, 256]               0
 ConvTranspose2d-135         [-1, 16, 256, 512]           9,232
     BatchNorm2d-136         [-1, 16, 256, 512]              32
  UpsamplerBlock-137         [-1, 16, 256, 512]               0
          Conv2d-138         [-1, 16, 256, 512]             784
          Conv2d-139         [-1, 16, 256, 512]             784
     BatchNorm2d-140         [-1, 16, 256, 512]              32
          Conv2d-141         [-1, 16, 256, 512]             784
          Conv2d-142         [-1, 16, 256, 512]             784
     BatchNorm2d-143         [-1, 16, 256, 512]              32
non_bottleneck_1d-144         [-1, 16, 256, 512]               0
          Conv2d-145         [-1, 16, 256, 512]             784
          Conv2d-146         [-1, 16, 256, 512]             784
     BatchNorm2d-147         [-1, 16, 256, 512]              32
          Conv2d-148         [-1, 16, 256, 512]             784
          Conv2d-149         [-1, 16, 256, 512]             784
     BatchNorm2d-150         [-1, 16, 256, 512]              32
non_bottleneck_1d-151         [-1, 16, 256, 512]               0
 ConvTranspose2d-152        [-1, 20, 512, 1024]           1,300
             Net-153        [-1, 20, 512, 1024]               0
================================================================
Total params: 2,064,256
Trainable params: 2,064,256
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 6.00
Forward/backward pass size (MB): 1984.00
Params size (MB): 7.87
Estimated Total Size (MB): 1997.87
----------------------------------------------------------------
FLOPS: 29.90 GFLOPS
Model saved after pruning.
Model zipped after pruning.
Zipped model size before pruning: 7.295009613037109 MB
Zipped model size after pruning: 3.487201690673828 MB